*>*********************************************
*> VIEWMESSAGES_SRC.cob                        *
*> Copybook: View Messages                     *
*> Week 8 - Basic Messaging System Part 1     *
*>*********************************************

      *>---------------------------------------------
      *> VIEW-MY-MESSAGES
      *> Purpose: Display all messages sent to or
      *>          from the logged-in user.
      *> Called:  From MESSAGES-MENU option 2
      *>---------------------------------------------
       VIEW-MY-MESSAGES.
           MOVE "Under construction." TO WS-OUTLINE
           PERFORM PRINT-LINE.



